## Final Project Submission

Please fill out:
* Student name: Kelvin Mwaura
* Student pace: full time
* Scheduled project review date/time: 
* Instructor name: Asha Deen
* Blog post URL:

GUIDING MICROSOFT'S MOVIE STUDIO VENTURE THROUGH EXPLORATORY DATA ANALYSIS.
1. Business Understanding



    a. Introduction

Microsoft recognizes the growing trend of big companies venturing into original video content creation and aims to establish its presence by launching a new movie studio. However, lacking expertise in the film industry, Microsoft is uncertain about the types of films that would yield the highest success at the box office. To make informed decisions about content creation, Microsoft seeks to understand the current landscape of successful movies and identify key factors contributing to their box office performance.


    b. Objectives
        1.1 General Objective

    To conduct a comprehensive analysis of recent box office trends and successful movie genres to provide actionable insights for Microsoft's new movie studio. By leveraging data analytics and market research, I will identify the top-performing genres, analyze audience preferences, and examine factors influencing box office success, such as budget, cast, storyline, and release timing. 
    The goal is to translate these findings into actionable recommendations that align with Microsoft's strategic objectives and creative vision. Ultimately, the objective is to empower the head of Microsoft's new movie studio with valuable insights to guide decision-making and maximize the studio's potential for success in the competitive film industry.

        1.2 Specific Objectives

        1. Loading datasets into pandas
        2. Retrieving data from a dataframe
        3. Data cleaning
        4. Exploratory data Analysis
        5. Data visualisation using seaborn and matplotlib

c. Questions To Answer

        1.What are the most popular genres in box office?
        2. How does the budget of a movie correlate with its box office success?
        3. Are there any trends in box office revenue over time for specific genres?
        4. What is the distribution of box office revenue among different movie genres?
        5.How do factors such as cast popularity, director reputation, and production company influence box office success?
        6. What are the typical characteristics (e.g., runtime, rating) of successful movies at the box office?
        7.Are there any emerging trends or niche genres showing potential for future success?

2. Data Understanding 

The dataset provided contains movie data sourced from multiple sources including Box Office Mojo, IMDB, Rotten Tomatoes, TheMovieDB, and The Numbers. Each dataset  contains information such as movie titles, release dates, genres, box office revenue, ratings, and other relevant attributes. 
Before proceeding with exploratory data analysis, it's essential to understand the structure, format, and quality of the data from each source to ensure accurate analysis and interpretation.

To begin our data exploration, we will import the necessary Python libraries for data manipulation, analysis, and visualization:

IMPORTING THE  DATA AND THE  RELEVANT PYTHON  LIBRARIES

In [5]:
import pandas as pd  # For data manipulation and analysis
import numpy as np   #For numerical computationst  # For data visualization
import sqlite3                    # for querying from the database
import seaborn as sns #for data visualisation
import matplotlib.pyplot as plt 
%matplotlib inline
import csv #for opening csv, tsv files
import os

OPENING THE FILES TO DO UNDERSTAND THE DATA(DATA EXPLORATION)

In [33]:
#opening the database file and creating a connection
db = 'im.db/im.db'
conn = sqlite3.connect(db)

In [34]:
#getting to see the different tables inside the database
conn= sqlite3.connect('im.db/im.db')
pd.read_sql("""
SELECT *
FROM sqlite_master
""",conn)

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

OPENING THE VARIOUS RELEVANT TABLES INSIDE THE DATABASE FILE

In [41]:
#opening  the MOVIE BASICS table to see the data inside 
movie_basics = pd.read_sql("""
SELECT *
FROM movie_basics;
""", conn)
movie_basics.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [39]:
##opening  the MOVIE RATINGS table to see the data inside 
movie_ratings = pd.read_sql("""SELECT *
FROM movie_ratings;
""", conn)
movie_ratings.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

LOOKING AT THE OTHER DATASETS AND FILES PROVIDED JUST TO SEE WHAT DATA I WILL USE FOR MY DATA ANALYSIS

In [43]:
import csv
import pandas as pd
#Creating the variable name tmdb in order to read the  csv file as a dataframe using the pandas library
tmdb = pd.read_csv('./tmdb.movies.csv.gz')
tmdb.head(10) #getting the first ten rows of our data

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
5,5,"[12, 14, 10751]",32657,en,Percy Jackson & the Olympians: The Lightning T...,26.691,2010-02-11,Percy Jackson & the Olympians: The Lightning T...,6.1,4229
6,6,"[28, 12, 14, 878]",19995,en,Avatar,26.526,2009-12-18,Avatar,7.4,18676
7,7,"[16, 10751, 35]",10193,en,Toy Story 3,24.445,2010-06-17,Toy Story 3,7.7,8340
8,8,"[16, 10751, 35]",20352,en,Despicable Me,23.673,2010-07-09,Despicable Me,7.2,10057
9,9,"[16, 28, 35, 10751, 878]",38055,en,Megamind,22.855,2010-11-04,Megamind,6.8,3635

In [19]:
tmdb.info() #previewing the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [20]:
import csv
import pandas as pd
#Creating the variable name bom-movie_gross in order to read the  csv file as a dataframe using the pandas library

bom_movie_gross= pd.read_csv('bom.movie_gross.csv.gz')
bom_movie_gross.head(10)

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
5,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000,2010
6,Iron Man 2,Par.,312400000.0,311500000,2010
7,Tangled,BV,200800000.0,391000000,2010
8,Despicable Me,Uni.,251500000.0,291600000,2010
9,How to Train Your Dragon,P/DW,217600000.0,277300000,2010

In [64]:
bom_movie_gross.describe() #getting the statistical measures

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [21]:
bom_movie_gross.info() #previewing the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [49]:
import csv
import pandas as pd
#Creating the variable name MOVIE BUDGETS in order to read the  csv file as a dataframe using the pandas library
movie_budgets = pd.read_csv('tn.movie_budgets.csv.gz')
movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [50]:
movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

I DECIDED TO USE  3 DATASETS  TO CONDUCT MY DATA ANALYSIS FROM THE FIVE PROVIDED. 
I excluded the 'tmdb.movies.csv.gz' data as it was not relavant to my analysis and the objectives of my project.

LETS NOW DO SOME ACTAUAL ANALYSIS AND CLEANING.

LETS GO BACK TO OUR DATABASE FILE AND EXPLORE THE MOVIE BASICS AND THE MOVIE RATINGS TABLES.

In [51]:
movie_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [53]:
movie_basics.nunique() #checking the unique values in movie basics

movie_id           146144
primary_title      136071
original_title     137773
start_year             19
runtime_minutes       367
genres               1085
dtype: int64

Checking to see if there are duplicates in the movie_basics unique columns

In [65]:
movie_basics['primary_title'].duplicated().sum() #there are 10073 duplicated primary titles (aren't the ID's different?)

10073

In [56]:
movie_basics[movie_basics['primary_title'].duplicated()].head(80) #looking at just 80 rows of the duplicated primary titles

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
706,tt10022974,Nemesis,Nemesis,2019,NaN,"Action,Thriller"
948,tt10064536,Untitled Disney Marvel Film,Untitled Disney Marvel Film,2022,NaN,Action
949,tt10064558,Untitled Marvel Film,Untitled Marvel Film,2021,NaN,Action
1478,tt10127292,Plushtubers: The Apocalypse,Plushtubers: The Apocalypse,2019,NaN,"Action,Adventure"
1622,tt10148772,Indemnity,Indemnity,2018,45.0,Thriller
...,...,...,...,...,...,...
7049,tt1372686,Coriolanus,Coriolanus,2011,123.0,"Drama,Thriller,War"
7050,tt1372689,Stranded,Djinns,2010,103.0,"Horror,Mystery"
7057,tt1373454,Bad Faith,Ond tro,2010,106.0,Thriller
7083,tt1376717,Play,Play,2011,118.0,Drama
7104,tt1380279,Rebirth,Rebirth,2011,105.0,Documentary

Could one primary title be used for different movies? Let's find out.

In [57]:
movie_basics[movie_basics['primary_title'] == 'Indemnity'] #some primary titles are clearly being used more than once to refer to different movies as seen below.

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
1386,tt10115438,Indemnity,Indemnity,2020,NaN,"Romance,Thriller"
1622,tt10148772,Indemnity,Indemnity,2018,45.0,Thriller
17835,tt1792806,Indemnity,Indemnity,2012,51.0,"Drama,Horror,Mystery"

To try solving this we can try using movie ID instead and see if it will work

In [62]:
movie_basics[movie_basics['primary_title'] == 'Plushtubers: The Apocalypse'] #same movie different movie ID's #Cant use movie ID either

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
1477,tt10127274,Plushtubers: The Apocalypse,Plushtubers: The Apocalypse,2019,NaN,"Action,Adventure"
1478,tt10127292,Plushtubers: The Apocalypse,Plushtubers: The Apocalypse,2019,NaN,"Action,Adventure"

In [63]:
movie_basics.describe()

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

The movie ID is the primary key in the movie basics dataset
Some movies have the same primary title but are  clearly no identical based of the genres and the run time columns .
There are 10073 duplicates(same primary title but with different movie id's)

In [66]:
# Let's look at the movie ratings
movie_ratings = pd.read_sql("""
SELECT *
FROM movie_ratings;
""", conn)

movie_ratings.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [67]:
movie_ratings.info() #info about thr data set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [68]:
movie_ratings.describe() #statistical measures about the datatset

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [69]:
movie_ratings['movie_id'].duplicated().sum() #no duplicates. whoop! whoop!

0

In [70]:
#movie with the highest numvotes from the statistical measures
movie_ratings[movie_ratings['numvotes']==1841066]

        movie_id  averagerating  numvotes
63498  tt1375666            8.8   1841066

In [71]:
#which movie is it(using the movie ID)
movie_basics[movie_basics['movie_id']=='tt1375666']

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
7066,tt1375666,Inception,Inception,2010,148.0,"Action,Adventure,Sci-Fi"

Movie Id is still the primary key here
No duplicate values